package javaRushUniversity.javaSyntax.level03.lesson03;

import java.util.Scanner;

/*
Share a Coke
*/

/* Share a Coke

Давай разделим ящик колы на кабинет программистов. Для этого напишем программу, в которой:

    Нужно ввести с клавиатуры два целых числа. Первое число - количество банок колы в ящике. Второе - количество людей в кабинете.
    Вывести на экран результат деления первого числа на второе.

Результатом должно быть вещественное число. */

public class Solution04 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Я тут");
//        Scanner scanner = new Scanner(System.in);
//        int number1 = scanner.nextInt();
//        int number2 = scanner.nextInt();
//        System.out.println(number1 * 1.0 / number2);
    }
}
