package javaRushUniversity.javaSyntax.level02.lesson01; // task01.task0109;

/*
Мой юный друг
*/

/* Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.
 */

public class Solution02 {
    public static void main(String[] args) {
        //напишите тут ваш код
        int currentYear = 3126;
        int friendYear = currentYear - 8;
        System.out.println(friendYear);
    }
}
